package lesson8.text;


public class Main {
//    public  String getText(String text) {
//        private static String getLowerCaseString(String str) {
//            StringBuffer sb = new StringBuffer();
//        System.out.println(text);
//        return str;
//    }

    public static void main(String[] args) {
//        Напишите метод, который принимает в качестве параметра любую строку, например “I like Java!!!”.
//        - Распечатать последний символ строки. Используем метод String.charAt().
//                - Проверить, заканчивается ли ваша строка подстрокой “!!!”. Используем метод String.endsWith().
//                - Проверить, начинается ли ваша строка подстрокой “I like”. Используем метод String.startsWith().
//                - Проверить, содержит ли ваша строка подстроку “Java”. Используем метод String.contains().
//                - Найти позицию подстроки “Java” в строке “I like Java!!!”.
//        - Заменить все символы “а” на “о”.
//        - Преобразуйте строку к верхнему регистру.
//        - Преобразуйте строку к нижнему регистру.
//    }
//        public class Task053 {
//            public static void main(String[] args) {
//                String str = "sfdFАSsdfs sfdSFфвыВфвФФdsdfs dsВВfS";
//                System.out.println(getLowerCaseString(str));
//            }
//
//            private static String getLowerCaseString(String str) {
//                StringBuffer sb = new StringBuffer();
//                if (str != null) {
//                    for (char symbol : str.toCharArray()) {
//                        if (symbol >= 'А' && symbol <= 'Я') {
//                            symbol = Character.toLowerCase(symbol);
//                        }
//                        sb.append(symbol);
//                    }
//                }
//                return sb.toString();
//            }
//        }
//    }


    }
}
